# Information about Toys

In [1]:
import pandas as pd

In [2]:
folder = r"C:\Users\Tim\Downloads" # Change this to your folder path
# filename = f'{folder}\puzzles_exp.csv'


# import os.path
# filepath = os.join(folder, "puzzles_exp.csv")

filepath = "Data/puzzles_exp.csv"

In [3]:
df = pd.read_csv(filepath)

## Show me the first 5 lines

In [4]:
df.head()

     Month  Product  Expenditure
0  2014-07  Puzzles        18411
1  2014-08  Puzzles        15432
2  2014-09  Puzzles       303623
3  2014-10  Puzzles        19697
4  2014-11  Puzzles       269769

## Show me the last 3 rows

In [5]:
df.tail(3)

     Month  Product  Expenditure
3  2014-10  Puzzles        19697
4  2014-11  Puzzles       269769
5  2014-12  Puzzles        49918

## Find the number of rows

In [6]:
df.shape

(6, 3)

In [7]:
df.shape[0]

6

## What are the datatypes for each column?

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Month        6 non-null      object
 1   Product      6 non-null      object
 2   Expenditure  6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [9]:
df.head()

     Month  Product  Expenditure
0  2014-07  Puzzles        18411
1  2014-08  Puzzles        15432
2  2014-09  Puzzles       303623
3  2014-10  Puzzles        19697
4  2014-11  Puzzles       269769

## Parse Month column as a Datetime datatype

In [10]:
df = pd.read_csv(filepath, parse_dates=['Month'])
df

       Month  Product  Expenditure
0 2014-07-01  Puzzles        18411
1 2014-08-01  Puzzles        15432
2 2014-09-01  Puzzles       303623
3 2014-10-01  Puzzles        19697
4 2014-11-01  Puzzles       269769
5 2014-12-01  Puzzles        49918

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Month        6 non-null      datetime64[ns]
 1   Product      6 non-null      object
 2   Expenditure  6 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 276.0+ bytes

In [12]:
df

       Month  Product  Expenditure
0 2014-07-01  Puzzles        18411
1 2014-08-01  Puzzles        15432
2 2014-09-01  Puzzles       303623
3 2014-10-01  Puzzles        19697
4 2014-11-01  Puzzles       269769
5 2014-12-01  Puzzles        49918

## Find total expenditure for each Quarter

In [13]:
df.Month.dt.month_name()

0         July
1       August
2    September
3      October
4     November
5     December
Name: Month, dtype: object

In [14]:
df.Month.dt.quarter

0    3
1    3
2    3
3    4
4    4
5    4
Name: Month, dtype: int32

In [15]:
# df.loc[row_index, col_index] = Series/list of values
df.loc[:, 'Qtr'] = df.Month.dt.quarter
df

       Month  Product  Expenditure  Qtr
0 2014-07-01  Puzzles        18411    3
1 2014-08-01  Puzzles        15432    3
2 2014-09-01  Puzzles       303623    3
3 2014-10-01  Puzzles        19697    4
4 2014-11-01  Puzzles       269769    4
5 2014-12-01  Puzzles        49918    4

In [16]:
q_num = 3
q_str = f'Q{q_num}'
q_str

'Q3'

In [17]:
df.apply(len) # access every column

Month          6
Product        6
Expenditure    6
Qtr            6
dtype: int64

In [18]:
df.apply(len, axis=1) # access every row

0    4
1    4
2    4
3    4
4    4
5    4
dtype: int64

In [19]:
df.loc[0]

Month          2014-07-01 00:00:00
Product                    Puzzles
Expenditure                  18411
Qtr                              3
Name: 0, dtype: object

In [20]:
df.loc[0].Qtr

3

In [21]:
# Apply this function for every row
df.apply(lambda row: f'Q{row.Qtr}', axis=1)

0    Q3
1    Q3
2    Q3
3    Q4
4    Q4
5    Q4
dtype: object

### Convert Qtr column to "String" column

In [22]:
df.loc[:, 'Qtr'] = df.Qtr.astype(str)
df

/var/folders/b3/njv4_yv125j44rpbkvlkn_880000gn/T/ipykernel_31955/561582466.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['3' '3' '3' '4' '4' '4']' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  df.loc[:, 'Qtr'] = df.Qtr.astype(str)

       Month  Product  Expenditure Qtr
0 2014-07-01  Puzzles        18411   3
1 2014-08-01  Puzzles        15432   3
2 2014-09-01  Puzzles       303623   3
3 2014-10-01  Puzzles        19697   4
4 2014-11-01  Puzzles       269769   4
5 2014-12-01  Puzzles        49918   4

In [23]:
df.loc[:, 'Qtr'] = df.apply(lambda row: f'Q{row.Qtr}', axis=1) 
df

       Month  Product  Expenditure Qtr
0 2014-07-01  Puzzles        18411  Q3
1 2014-08-01  Puzzles        15432  Q3
2 2014-09-01  Puzzles       303623  Q3
3 2014-10-01  Puzzles        19697  Q4
4 2014-11-01  Puzzles       269769  Q4
5 2014-12-01  Puzzles        49918  Q4

In [36]:
df.loc[2]

Month          2014-09-01 00:00:00
Product                    Puzzles
Expenditure                 303623
Qtr                             Q3
Name: 2, dtype: object

In [29]:
df.columns

Index(['Month', 'Product', 'Expenditure', 'Qtr'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=6, step=1)

## Find total expenses for every Quarter

In [26]:
dfq = df[ ['Expenditure', 'Qtr'] ].groupby('Qtr').sum()
dfq

     Expenditure
Qtr
Q3        337466
Q4        339384

In [27]:
dfq.columns

Index(['Expenditure'], dtype='object')

In [28]:
dfq.index

Index(['Q3', 'Q4'], dtype='object', name='Qtr')

### Fetch expenditure for Q3

In [31]:
dfq.loc['Q3']

Expenditure    337466
Name: Q3, dtype: int64

## Make the index / row label a column

In [33]:
dfq_new = dfq.reset_index()
dfq_new

  Qtr  Expenditure
0  Q3       337466
1  Q4       339384

In [34]:
dfq_new.columns

Index(['Qtr', 'Expenditure'], dtype='object')

In [35]:
dfq_new.index

RangeIndex(start=0, stop=2, step=1)

## Filtering columns based on criteria

In [37]:
df

       Month  Product  Expenditure Qtr
0 2014-07-01  Puzzles        18411  Q3
1 2014-08-01  Puzzles        15432  Q3
2 2014-09-01  Puzzles       303623  Q3
3 2014-10-01  Puzzles        19697  Q4
4 2014-11-01  Puzzles       269769  Q4
5 2014-12-01  Puzzles        49918  Q4

#### Show rows with expenses more 50,000

In [39]:
5_000_000

5000000

In [42]:
df.Expenditure > 50_000

0    False
1    False
2     True
3    False
4     True
5    False
Name: Expenditure, dtype: bool

In [41]:
df[ df.Expenditure > 50_000 ]

       Month  Product  Expenditure Qtr
2 2014-09-01  Puzzles       303623  Q3
4 2014-11-01  Puzzles       269769  Q4

### Show rows where Expenditure is less than 50,000 but only for Q4

In [44]:
(df.Expenditure < 50_000) & (df.Qtr == "Q4")

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [45]:
df[ (df.Expenditure < 50_000) & (df.Qtr == "Q4") ]

       Month  Product  Expenditure Qtr
3 2014-10-01  Puzzles        19697  Q4
5 2014-12-01  Puzzles        49918  Q4

### Summary of steps followed

- df = pd.read_csv(filepath, parse_dates=['Month'])
- df.loc[:, 'Qtr'] = df.apply(lambda row: f'Q{row.Month.quarter}', axis=1)
- dfq_new = df[ ['Expenditure', 'Qtr'] ].groupby('Qtr').sum().reset_index()

In [47]:
df = pd.read_csv(filepath, parse_dates=['Month'])
df.loc[:, 'Qtr'] = df.apply(lambda row: f'Q{row.Month.quarter}', axis=1)
dfq_new = df[ ['Expenditure', 'Qtr'] ].groupby('Qtr').sum().reset_index()
dfq_new

  Qtr  Expenditure
0  Q3       337466
1  Q4       339384